/*
 Navicat Premium Data Transfer

 Source Server         : 127.0.0.1
 Source Server Type    : MySQL
 Source Server Version : 50737
 Source Host           : localhost:3306
 Source Schema         : testpro

 Target Server Type    : MySQL
 Target Server Version : 50737
 File Encoding         : 65001

 Date: 03/04/2022 21:27:52
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for meeting
-- ----------------------------
DROP TABLE IF EXISTS `meeting`;
CREATE TABLE `meeting` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `created_at` datetime(3) DEFAULT NULL,
  `updated_at` datetime(3) DEFAULT NULL,
  `remark` longtext COMMENT '备注',
  `mt_name` longtext COMMENT '会议名称',
  `mt_theme` longtext COMMENT '会议主题',
  `mt_summary` longtext COMMENT '会议概要',
  `mt_content` longtext COMMENT '会议内容',
  `mt_member` longtext COMMENT '参会人员',
  `mt_time` longtext COMMENT '开会时间',
  `create_user` bigint(20) DEFAULT NULL COMMENT '创建人',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=33 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of meeting
-- ----------------------------
BEGIN;
INSERT INTO `meeting` VALUES (7, '2022-04-01 21:31:37.028', '2022-04-03 01:14:16.368', '123123', '会议名称123', '会议主题123', '会议概要677', '会议内容6', '成员6', '2022-04-01 00:00:00', 0);
INSERT INTO `meeting` VALUES (12, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称11', '会议主题11', '会议概要11', '会议内容11', '成员11', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (14, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称13', '会议主题13', '会议概要13', '会议内容13', '成员13', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (15, '2022-04-01 21:31:37.028', '2022-04-02 17:39:41.740', '', '新增会议A', '新增会议主题B', '新增会议概要C', '新增会议内容C', '新增会议成员D', '2022-02-20 14:00:00', 0);
INSERT INTO `meeting` VALUES (16, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称15', '会议主题15', '会议概要15', '会议内容15', '成员15', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (17, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称16', '会议主题16', '会议概要16', '会议内容16', '成员16', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (18, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称17', '会议主题17', '会议概要17', '会议内容17', '成员17', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (19, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称18', '会议主题18', '会议概要18', '会议内容18', '成员18', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (20, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称19', '会议主题19', '会议概要19', '会议内容19', '成员19', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (21, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称20', '会议主题20', '会议概要20', '会议内容20', '成员20', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (22, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称21', '会议主题21', '会议概要21', '会议内容21', '成员21', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (23, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称22', '会议主题22', '会议概要22', '会议内容22', '成员22', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (24, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称23', '会议主题23', '会议概要23', '会议内容23', '成员23', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (25, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称24', '会议主题24', '会议概要24', '会议内容24', '成员24', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (26, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称25', '会议主题25', '会议概要25', '会议内容25', '成员25', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (27, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称26', '会议主题26', '会议概要26', '会议内容26', '成员26', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (28, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称27', '会议主题27', '会议概要27', '会议内容27', '成员27', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (29, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称28', '会议主题28', '会议概要28', '会议内容28', '成员28', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (30, '2022-04-01 21:31:37.028', '2022-04-01 21:31:37.028', '', '会议名称29', '会议主题29', '会议概要29', '会议内容29', '成员29', '2022-04-01', 0);
INSERT INTO `meeting` VALUES (32, '2022-04-03 01:14:29.513', '2022-04-03 21:26:40.894', '66666', '111111', '22222', '3333344', '44444', '55555', '2022-04-03 01:14:18', -1);
COMMIT;

-- ----------------------------
-- Table structure for message
-- ----------------------------
DROP TABLE IF EXISTS `message`;
CREATE TABLE `message` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `created_at` datetime(3) DEFAULT NULL,
  `updated_at` datetime(3) DEFAULT NULL,
  `remark` longtext COMMENT '备注',
  `theme` longtext COMMENT '消息标题',
  `content` longtext COMMENT '消息内容',
  `is_read` bigint(20) DEFAULT NULL COMMENT '是否已读',
  `receive_user` bigint(20) DEFAULT NULL COMMENT '接收人id',
  `send_user` bigint(20) DEFAULT NULL COMMENT '发送人id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of message
-- ----------------------------
BEGIN;
INSERT INTO `message` VALUES (5, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题4', '这是消息的具体内容4这是消息的具体内容4这是消息的具体内容4这是消息的具体内容4这是消息的具体内容4', 0, 0, 0);
INSERT INTO `message` VALUES (7, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题6', '这是消息的具体内容6这是消息的具体内容6这是消息的具体内容6这是消息的具体内容6这是消息的具体内容6', 0, 0, 0);
INSERT INTO `message` VALUES (8, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题7', '这是消息的具体内容7这是消息的具体内容7这是消息的具体内容7这是消息的具体内容7这是消息的具体内容7', 0, 0, 0);
INSERT INTO `message` VALUES (9, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题8', '这是消息的具体内容8这是消息的具体内容8这是消息的具体内容8这是消息的具体内容8这是消息的具体内容8', 0, 0, 0);
INSERT INTO `message` VALUES (10, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题9', '这是消息的具体内容9这是消息的具体内容9这是消息的具体内容9这是消息的具体内容9这是消息的具体内容9', 0, 0, 0);
INSERT INTO `message` VALUES (11, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题10', '这是消息的具体内容10这是消息的具体内容10这是消息的具体内容10这是消息的具体内容10这是消息的具体内容10', 0, 0, 0);
INSERT INTO `message` VALUES (12, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题11', '这是消息的具体内容11这是消息的具体内容11这是消息的具体内容11这是消息的具体内容11这是消息的具体内容11', 0, 0, 0);
INSERT INTO `message` VALUES (13, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题12', '这是消息的具体内容12这是消息的具体内容12这是消息的具体内容12这是消息的具体内容12这是消息的具体内容12', 0, 0, 0);
INSERT INTO `message` VALUES (14, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题13', '这是消息的具体内容13这是消息的具体内容13这是消息的具体内容13这是消息的具体内容13这是消息的具体内容13', 0, 0, 0);
INSERT INTO `message` VALUES (15, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题14', '这是消息的具体内容14这是消息的具体内容14这是消息的具体内容14这是消息的具体内容14这是消息的具体内容14', 0, 0, 0);
INSERT INTO `message` VALUES (16, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题15', '这是消息的具体内容15这是消息的具体内容15这是消息的具体内容15这是消息的具体内容15这是消息的具体内容15', 0, 0, 0);
INSERT INTO `message` VALUES (17, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题16', '这是消息的具体内容16这是消息的具体内容16这是消息的具体内容16这是消息的具体内容16这是消息的具体内容16', 0, 0, 0);
INSERT INTO `message` VALUES (18, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题17', '这是消息的具体内容17这是消息的具体内容17这是消息的具体内容17这是消息的具体内容17这是消息的具体内容17', 0, 0, 0);
INSERT INTO `message` VALUES (19, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题18', '这是消息的具体内容18这是消息的具体内容18这是消息的具体内容18这是消息的具体内容18这是消息的具体内容18', 0, 0, 0);
INSERT INTO `message` VALUES (20, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题19', '这是消息的具体内容19这是消息的具体内容19这是消息的具体内容19这是消息的具体内容19这是消息的具体内容19', 0, 0, 0);
INSERT INTO `message` VALUES (21, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题20', '这是消息的具体内容20这是消息的具体内容20这是消息的具体内容20这是消息的具体内容20这是消息的具体内容20', 0, 0, 0);
INSERT INTO `message` VALUES (22, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题21', '这是消息的具体内容21这是消息的具体内容21这是消息的具体内容21这是消息的具体内容21这是消息的具体内容21', 0, 0, 0);
INSERT INTO `message` VALUES (23, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题22', '这是消息的具体内容22这是消息的具体内容22这是消息的具体内容22这是消息的具体内容22这是消息的具体内容22', 0, 0, 0);
INSERT INTO `message` VALUES (24, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题23', '这是消息的具体内容23这是消息的具体内容23这是消息的具体内容23这是消息的具体内容23这是消息的具体内容23', 0, 0, 0);
INSERT INTO `message` VALUES (25, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题24', '这是消息的具体内容24这是消息的具体内容24这是消息的具体内容24这是消息的具体内容24这是消息的具体内容24', 0, 0, 0);
INSERT INTO `message` VALUES (26, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题25', '这是消息的具体内容25这是消息的具体内容25这是消息的具体内容25这是消息的具体内容25这是消息的具体内容25', 0, 0, 0);
INSERT INTO `message` VALUES (27, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题26', '这是消息的具体内容26这是消息的具体内容26这是消息的具体内容26这是消息的具体内容26这是消息的具体内容26', 0, 0, 0);
INSERT INTO `message` VALUES (28, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题27', '这是消息的具体内容27这是消息的具体内容27这是消息的具体内容27这是消息的具体内容27这是消息的具体内容27', 0, 0, 0);
INSERT INTO `message` VALUES (29, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题28', '这是消息的具体内容28这是消息的具体内容28这是消息的具体内容28这是消息的具体内容28这是消息的具体内容28', 0, 0, 0);
INSERT INTO `message` VALUES (30, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题29', '这是消息的具体内容29这是消息的具体内容29这是消息的具体内容29这是消息的具体内容29这是消息的具体内容29', 0, 0, 0);
INSERT INTO `message` VALUES (31, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题30', '这是消息的具体内容30这是消息的具体内容30这是消息的具体内容30这是消息的具体内容30这是消息的具体内容30', 0, 0, 0);
INSERT INTO `message` VALUES (32, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题31', '这是消息的具体内容31这是消息的具体内容31这是消息的具体内容31这是消息的具体内容31这是消息的具体内容31', 0, 0, 0);
INSERT INTO `message` VALUES (33, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题32', '这是消息的具体内容32这是消息的具体内容32这是消息的具体内容32这是消息的具体内容32这是消息的具体内容32', 0, 0, 0);
INSERT INTO `message` VALUES (35, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题34', '这是消息的具体内容34这是消息的具体内容34这是消息的具体内容34这是消息的具体内容34这是消息的具体内容34', 0, 0, 0);
INSERT INTO `message` VALUES (37, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题36', '这是消息的具体内容36这是消息的具体内容36这是消息的具体内容36这是消息的具体内容36这是消息的具体内容36', 0, 0, 0);
INSERT INTO `message` VALUES (38, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题37', '这是消息的具体内容37这是消息的具体内容37这是消息的具体内容37这是消息的具体内容37这是消息的具体内容37', 0, 0, 0);
INSERT INTO `message` VALUES (39, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题38', '这是消息的具体内容38这是消息的具体内容38这是消息的具体内容38这是消息的具体内容38这是消息的具体内容38', 0, 0, 0);
INSERT INTO `message` VALUES (40, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题39', '这是消息的具体内容39这是消息的具体内容39这是消息的具体内容39这是消息的具体内容39这是消息的具体内容39', 0, 0, 0);
INSERT INTO `message` VALUES (41, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题40', '这是消息的具体内容40这是消息的具体内容40这是消息的具体内容40这是消息的具体内容40这是消息的具体内容40', 0, 0, 0);
INSERT INTO `message` VALUES (42, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题41', '这是消息的具体内容41这是消息的具体内容41这是消息的具体内容41这是消息的具体内容41这是消息的具体内容41', 0, 0, 0);
INSERT INTO `message` VALUES (43, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题42', '这是消息的具体内容42这是消息的具体内容42这是消息的具体内容42这是消息的具体内容42这是消息的具体内容42', 0, 0, 0);
INSERT INTO `message` VALUES (44, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题43', '这是消息的具体内容43这是消息的具体内容43这是消息的具体内容43这是消息的具体内容43这是消息的具体内容43', 0, 0, 0);
INSERT INTO `message` VALUES (45, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题44', '这是消息的具体内容44这是消息的具体内容44这是消息的具体内容44这是消息的具体内容44这是消息的具体内容44', 0, 0, 0);
INSERT INTO `message` VALUES (46, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题45', '这是消息的具体内容45这是消息的具体内容45这是消息的具体内容45这是消息的具体内容45这是消息的具体内容45', 0, 0, 0);
INSERT INTO `message` VALUES (47, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题46', '这是消息的具体内容46这是消息的具体内容46这是消息的具体内容46这是消息的具体内容46这是消息的具体内容46', 0, 0, 0);
INSERT INTO `message` VALUES (48, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题47', '这是消息的具体内容47这是消息的具体内容47这是消息的具体内容47这是消息的具体内容47这是消息的具体内容47', 0, 0, 0);
INSERT INTO `message` VALUES (49, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题48', '这是消息的具体内容48这是消息的具体内容48这是消息的具体内容48这是消息的具体内容48这是消息的具体内容48', 0, 0, 0);
INSERT INTO `message` VALUES (50, '2022-04-01 21:31:37.024', '2022-04-01 21:31:37.024', '', '消息主题49', '这是消息的具体内容49这是消息的具体内容49这是消息的具体内容49这是消息的具体内容49这是消息的具体内容49', 0, 0, 0);
COMMIT;

-- ----------------------------
-- Table structure for sys_user
-- ----------------------------
DROP TABLE IF EXISTS `sys_user`;
CREATE TABLE `sys_user` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `created_at` datetime(3) DEFAULT NULL,
  `updated_at` datetime(3) DEFAULT NULL,
  `remark` longtext COMMENT '备注',
  `username` longtext COMMENT '用户登录名',
  `password` longtext COMMENT '用户登录密码',
  `nickname` longtext COMMENT '用户昵称',
  `phone` longtext COMMENT '用户手机号码',
  `header_img` varchar(191) DEFAULT 'https://qmplusimg.henrongyi.top/gva_header.jpg' COMMENT '用户头像',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of sys_user
-- ----------------------------
BEGIN;
COMMIT;

-- ----------------------------
-- Table structure for upload_and_download
-- ----------------------------
DROP TABLE IF EXISTS `upload_and_download`;
CREATE TABLE `upload_and_download` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `created_at` datetime(3) DEFAULT NULL,
  `updated_at` datetime(3) DEFAULT NULL,
  `remark` longtext COMMENT '备注',
  `name` longtext COMMENT '文件名',
  `url` longtext COMMENT '文件地址',
  `tag` longtext COMMENT '文件标签',
  `key` longtext COMMENT '编号',
  `meeting_id` bigint(20) unsigned DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=48 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of upload_and_download
-- ----------------------------
BEGIN;
INSERT INTO `upload_and_download` VALUES (45, '2022-04-03 21:26:39.163', '2022-04-03 21:26:40.885', '', '2022_04_03_21_26_39_821file.png', 'uploads/file/2022_04_03_21_26_39_821file.png', '普通文件', '普通文件', 32);
INSERT INTO `upload_and_download` VALUES (46, '2022-04-03 21:26:39.165', '2022-04-03 21:26:40.885', '', '2022_04_03_21_26_39_51file.png', 'uploads/file/2022_04_03_21_26_39_51file.png', '普通文件', '普通文件', 32);
INSERT INTO `upload_and_download` VALUES (47, '2022-04-03 21:26:39.180', '2022-04-03 21:26:40.885', '', '2022_04_03_21_26_39_937file.png', 'uploads/file/2022_04_03_21_26_39_937file.png', '普通文件', '普通文件', 32);
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
